{
    "alarms": [
        {
            "index": 4002,
            "name": "CASSANDRA_NOT_YET_CLUSTERED",
            "cause": "DATABASE_INCONSISTENCY",
            "levels": [
                {
                    "severity": "CLEARED",
                    "details": "The local Cassandra process is synchronized with the rest of the cluster.",
                    "description": "Cassandra: The local Cassandra is part of the Cassandra cluster"
                },
                {
                    "severity": "MAJOR",
                    "details": "The local Cassandra process is not yet part of a cluster. This node will not see any changes made by other nodes, or vice versa.You should not direct service traffic to this node until this alarm is cleared.",
                    "description": "Cassandra: The local Cassandra is not yet part of a cluster"
                }
            ]
        },
        {
            "index": 4003,
            "name": "CASSANDRA_NOT_YET_DECOMMISSIONED",
            "cause": "DATABASE_INCONSISTENCY",
            "levels": [
                {
                    "severity": "CLEARED",
                    "details": "The local Cassandra process has been decommissioned and can now be terminated without risk of loss of data.",
                    "description": "Cassandra: The local Cassandra has been removed from the Cassandra cluster"
                },
                {
                    "severity": "MAJOR",
                    "details": "The local Cassandra process is being decommissioned. This node should not be terminated until decommissioning is complete. Doing so could result in loss of data.",
                    "description": "Cassandra: The local Cassandra is being decommissioned"
                }
            ]
        },
        {
            "index": 3501,
            "name": "MEMCACHED_NOT_YET_CLUSTERED",
            "cause": "DATABASE_INCONSISTENCY",
            "levels": [
                {
                    "severity": "CLEARED",
                    "details": "The local Memcached process is synchronized with the rest of the cluster. Changes made by this node (e.g. to subscriber registrations) will be correctly replicated.",
                    "description": "Memcached: The local Memcached is part of the cluster"
                },
                {
                    "severity": "MAJOR",
                    "details": "The local Memcached process is not yet part of a cluster. This node will not see any changes made by other nodes, or vice versa.You should not direct service traffic to this node until this alarm is cleared.",
                    "description": "Memcached: The local Memcached is not yet part of a cluster"
                }
            ]
        },
        {
            "index": 3003,
            "name": "CHRONOS_NOT_YET_CLUSTERED",
            "cause": "DATABASE_INCONSISTENCY",
            "levels": [
                {
                    "severity": "CLEARED",
                    "details": "The local Chronos process is synchronized with the rest of the cluster. Timer requests sent to this node will be correctly replicated across the Chronos cluster.",
                    "description": "Chronos: The local Chronos is part of the Chronos cluster"
                },
                {
                    "severity": "MAJOR",
                    "details": "The local Chronos process is not yet part of a Chronos cluster. Timer requests sent to this node will not be replicated correctly. You should not direct service traffic to this node until this alarm is cleared.",
                    "description": "Chronos: The local Chronos is not yet part of a cluster"
                }
            ]
        },
        {
            "index": 6502,
            "name": "TOO_LONG_CLUSTERING",
            "cause": "DATABASE_INCONSISTENCY",
            "levels": [
                {
                    "severity": "CLEARED",
                    "details": "An automatic scale-up or scale-down process has completed after running for more than 15 minutes. Further nodes can now be added to or removed from the cluster.",
                    "description": "etcd: Scaling process has finished"
                },
                {
                    "severity": "MINOR",
                    "details": "An automatic scale-up or scale-down process has been running for more than 15 minutes. Service is not impacted, but the scaling has not completed, and no further nodes can be added to or removed from the cluster until it completes.",
                    "description": "etcd: Scaling process has been running for more than 15 minutes"
                }
            ]
        }
    ]
}
